import numpy as np
import pandas as pd
dates=pd.date_range('20190101',periods=6)
df=pd.DataFrame(np.arange(24).reshape((6,4)),index=dates,columns=['A','B','C','D'])
print(df)
#              A   B   C   D
# 2019-01-01   0   1   2   3
# 2019-01-02   4   5   6   7
# 2019-01-03   8   9  10  11
# 2019-01-04  12  13  14  15
# 2019-01-05  16  17  18  19
# 2019-01-06  20  21  22  23

#设置值
df.iloc[2,2]=2019
df.loc['20190101','A']=2020
print(df)
#                A   B     C   D
# 2019-01-01  2020   1     2   3
# 2019-01-02     4   5     6   7
# 2019-01-03     8   9  2019  11
# 2019-01-04    12  13    14  15
# 2019-01-05    16  17    18  19
# 2019-01-06    20  21    22  23

#根据条件设置
df.B[df.A>4]=0#改变B中的值，对于A中大于4的位置，将B的相应位置改为0

#根据行和列设置
df['F']=np.nan
print(df)
#                A  B     C   D   F
# 2019-01-01  2020  0     2   3 NaN
# 2019-01-02     4  5     6   7 NaN
# 2019-01-03     8  0  2019  11 NaN
# 2019-01-04    12  0    14  15 NaN
# 2019-01-05    16  0    18  19 NaN
# 2019-01-06    20  0    22  23 NaN

#添加数据
df['E']=pd.Series([1,2,3,4,5,6],index=pd.date_range('20190101',periods=6))
print(df)
#                A  B     C   D   F  E
# 2019-01-01  2020  0     2   3 NaN  1
# 2019-01-02     4  5     6   7 NaN  2
# 2019-01-03     8  0  2019  11 NaN  3
# 2019-01-04    12  0    14  15 NaN  4
# 2019-01-05    16  0    18  19 NaN  5
# 2019-01-06    20  0    22  23 NaN  6